# while 只要满足条件就执行
i = 0
while i < 5
  puts i
  i += 1
end
# 0
# 1
# 2
# 3
# 4


#===================================================================================#
# unitl 执行到满足条件 就 停止
i = 0
until i == 5
  puts i
  i += 1
end
#0
#1
#2
#3
#4


#===================================================================================#
# for循环
# 1、第一个_表示循环中不需要用到 值
# 2、一般情况下是 i
for _ in 1..5
  puts 'hello'
end
# => hello
#    hello
#    hello
#    hello
#    hello


#===================================================================================#
# loop 永久循环
i = 0
loop do
  puts i
  i += 1
  break if i == 5
end

# 0
# 1
# 2
# 3
# 4


#===================================================================================#
# next  跳过本次循环
# break 打断整个循环
i = 0
10.times do |i|
  next if i == 5
  puts i
end
# 0
# 1
# 2
# 3
# 4
# 6
# 7
# 8
# 9


#===================================================================================#
# catch throw 打破循环退出
i = 1
catch(:exit) do
  loop do
    sleep 1
    i += 1
    throw :exit if i == 5
  end
end

