#===================================================================================#
# 退出
# 1、一般用于，退出ruby 代码执行
# 2、不要和异常捕获同时使用（会打断退出）

exit         # 仅这种形式为正常退出（终端啥都不显示） 
# 等价 exit(true)

exit!
# 等价 exit(false)

exit(300)
# 包含退出码


abort("just made a mistake")
# 终端错误退出，并打印信息


#===================================================================================#
# 退出回调
# ps：
# 1、执行回调顺序和注册顺序相反
# 2、exit! 不会执行回调

at_exit do
  puts 'A 退出回调'
end

at_exit do
  puts 'B 退出回调'
end

exit
# B 退出回调
# A 退出回调



