##################################################################################
# 调试 检测中间值
(1..10).tap{|x| puts "原本的样子：#{x.inspect}"}
       .to_a
       .tap{|x| puts "转数组后：#{x.inspect}"}
       .select{|x| x % 2 == 2}
       .tap{|x| puts "筛选后: #{x.inspect}"}
       .map{|x| x * x}
       .tap{|x| puts "map后： #{x.inspect}"}
# 原本的样子：1..10
# 转数组后：[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# 筛选后: []
# map后： []



##################################################################################
# 便捷填充数组/hash/字符串
[].tap do |i|
  i << 'hu'
  i << 'bar'
end
# => ["hu", "bar"]


"".tap do |i|
  i << 'hu'
  i << 'bar'
end
# => "hubar"


{}.tap do |i|
  i[:hu]  = 1
  i[:bar] = 2
end
# => {:hu=>1, :bar=>2}